# 각 줄마다 달아놓은 주석은 제가 달았습니다👨🏻‍💻

# ## 프로젝트 1. 경사 하강법으로 이미지 복원하기
# ### 프로젝트 개요와 목표
# 이번 프로젝트에서 우리가 풀 문제는 다음과 같습니다.
# 이미지 처리를 위해 만들어 두었던 weird_function() 함수에 실수로 버그가 들어가 100×100 픽셀의 오염된 미미지가 만들어졌습니다. 이 오염된 이미지와 오염되기 전 원본 이미지를 동시에 파일로 저장하려고 했으나, 모종의 이유로 원본 이미지 파일은 삭제된 상황입니다. 다행히도 weird_function()의 소스코드는 남아 있습니다. 오염된 이미지와 weird_function()을 활용해 원본 이미지를 복원해봅시다.
# *참고자료: https://github.com/jcjohnson/pytorch-examples, NYU Intro2ML*

import torch
import pickle #이미지 파일 로딩용
import matplotlib.pyplot as plt #관행적으로 plt


shp_original_img = (100, 100)
broken_image =  torch.FloatTensor( pickle.load(open('./broken_image_t.p', 'rb'),encoding='latin1' ) )


plt.imshow(broken_image.view(100,100)) #한 줄로 되어있는 이미지 데이터를 [100,100]형태로 변경.


def weird_function(x, n_iter=5):
    h = x    
    filt = torch.tensor([-1./3, 1./3, -1./3])
    for i in range(n_iter):
        zero_tensor = torch.tensor([1.0*0])
        h_l = torch.cat( (zero_tensor, h[:-1]), 0)
        h_r = torch.cat((h[1:], zero_tensor), 0 )
        h = filt[0] * h + filt[2] * h_l + filt[1] * h_r
        if i % 2 == 0:
            h = torch.cat( (h[h.shape[0]//2:],h[:h.shape[0]//2]), 0  )
    return h

#무작위 텐서를 weird_function() 함수에 입력해 얻은 가설 텐서와 오염된 이미지 사이의 오차를 구하는 함수
#가설과 이미지 오차 -> 이 오찻값이 최소가 되도록 랜덤 텐서를 바꾸는게 최종 목적
def distance_loss(hypothesis, broken_image):    
    return torch.dist(hypothesis, broken_image)

#이미지랑 같은 모양과 랭크를 지녀야 함 [10000]모양
random_tensor = torch.randn(10000, dtype = torch.float)

#learn rate: 학습률: 한 반복에서 최솟점으로 얼마나 많이 이동하는지 = 학습을 얼마나 급하게 하는지
#학습률이 너무 크면 오차함수의 최솟점을 찾지 못하고 지나침. 너무 작으면 학습 속도가 느림.

lr = 0.8
for i in range(0,20000):
    random_tensor.requires_grad_(True) #오차 함수를 random_tensor로 미분 그래야 경사하강법을 함.
    hypothesis = weird_function(random_tensor) #무작위 텐서를 weird에 통과시켜서 가설을 구함
    loss = distance_loss(hypothesis, broken_image) #가설과 깨진 이미지로 오차를 계산함.
    loss.backward() #loss를 random_tensor로 미분함
    with torch.no_grad(): #자동 기울기 계산을 비활성화. 왜냐: 파이토치는 그래프를 생성하는데 이 예제는 경사하강법을 직접 구현함.
        random_tensor = random_tensor - lr*random_tensor.grad #⭐️핵심 동작: loss.backward()에서 계산한 loss의 기울기를 반대쪽으로 학습률만큼 이동
      
    if i % 1000 == 0: #for문을 1000번 반복하면 오차를 출력.
        print('Loss at {} = {}'.format(i, loss.item()))

#반복문 다돌리고 random_tensor 확인
plt.imshow(random_tensor.view(100,100).data)

